# Этап 1: Используем официальный образ Python
FROM python:3.9-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем всю папку backend (включая static) в контейнер
COPY ./backend .

# Указываем, что приложение будет слушать порт 8000
EXPOSE 8000

# Команда для запуска приложения
# Мы используем 0.0.0.0, чтобы сервер был доступен извне контейнера
# Мы убираем reload=True, так как в продакшене он не нужен
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]
